package com.example.esperanto;

public class TextGrammar {
    public final static String PARTOY = "\nЧлена неопределенного нет; есть только определенный (la), " +
            "одинаковый для всех родов, падежей и чисел. \n" +
            "Существительное всегда оканчивается на о. \n" +
            "Пример: patro, kato \n" +
            "Глагол по лицам и числам не изменяется (например: mi faras - я делаю, la patro faras - отец делает, ili faras - они делают). Формы глагола:\n" +
            "а) Настоящее время принимает окончание as (например: mi faras - я делаю).\n" +
            "b) Прошедшее - is (li faris - он делал).\n" +
            "с) Будущее - os (ili faros - они будут делать).\n" +
            "^c) Условное наклонение - us (^si farus - она бы делала).\n" +
            "d) Повелительное наклонение - u (faru - делай, делайте).\n" +
            "е) Неопределенное наклонение - i (fari - делать). \n" +
            "Наречия оканчиваются на е. \n" +
            "Прилагательное всегда оканчивается на а.";
    public final static String LA = "\n1) В языке Эсперанто присутствует определённый артикль la, \" +\n" +
            "                        \"обозначающий то, что речь идёт об определённом предмете. \" +\n" +
            "                        \"Иногда это слово переводится как \\\"этот\\\", \\\"сей\\\", \\\"известный\\\"." +
            "2. Когда, говоря о чём-то или ком-то, обобществляют, т.е. думают о всех таких же: La homo (каждый человек) havas du piedojn." +
            "3. Когда имеют в виду что-то целое: Donu al mi la kafon (всё, упомянутое или указываемое кофе)! La knabo manĝis la panon (весь или упомянутый хлеб)." +
            "4. Обычно перед plej + прилагательное: Li estas la plej bona homo en la tuta mondo. Иногда перед plej + наречие (Margareto kantas la plej bele el ĉiuj), но этому подражать не следует." +
            "Артикль не употребляется:\n" +
            "\n" +
            "1. Перед именем собственным. Следовательно, никогда \"la Kopenhago, la Eŭropo, la Petro, la Espera" +
            "Артикль не употребляется также тогда, когда перед именем собственным находится какой-либо титул или другое слово, обозначающее ранг или профессию (sinjoro, sinjorino, fraŭlino, doktoro, advokato, ŝuisto, ŝoforo и т.д.)" +
            "\n" +
            "2. Перед названиями месяцев и дней недели" +
            "\n" +
            "3. Когда обобщённо говорят о веществах и временах года" +
            "4. Когда ставится какое-либо другое определяемое слово (tiu, mia, via и т.д.)";
    public final static String VOPROSS = "\nKiu? — кто? который? какой именно?\n" +
            "\n" +
            "Kiu vi estas? – Кто вы? Как вас зовут?\n" +
            "\n" +
            "Kio? – что? \n" +
            "\n" +
            "Kio ĝi estas? - Что это?\n"+"Kiu? — кто? который? какой именно?\n" +
            "\n" +
            "Kiu vi estas? – Кто вы? Как вас зовут?\n" +
            "\n" +
            "Kio? – что? \n" +
            "\n" +
            "Kio ĝi estas? - Что это?\n" +"Kiom? – сколько?         Kiom kostas la bileto?\n" +
            "\n" +
            " – Сколько стоит этот  билет?\n" +
            "\n" +
            "Kiam? – когда?\n" + " Kiam da jaroj vi havas? – Сколько вам лет?\n" +
            "\n" +
            "Kiel? – как? \n" + " Kiel vi pensas?  - Как ты думаешь?\n" +
            "\n" +
            "Kie? – где?\n" + "Kie estas miaj novaj kajeroj kaj skribiloj?\n" +
            "\n" +
            " –  Где мои новые тетради и ручки?\n" +
            "\n" + "Kien? – куда?\n" +
            " Kien vi iras? – Куда ты идешь?";
    public final static String MESTOIM = "\nmi" + "≈ \"говорящий (я)\"\n" + "ni" +
            "≈ \"говорящий и другой (другие) человек (люди) (мы)\"\n" + "vi" +
            "≈ \"адресат(ы) (ты, вы)\"\n" + "li" + "≈ \"лицо мужского пола, или лицо неизвестным пола (он)\"\n" +
            "ŝi" + "≈ \"лицо женского пола (она)\"\n" +
            "ĝi" + "≈ \"лицо среднего рода (оно, также для вещей, животных и пр.)\"\n" +
            "ili" + "≈ \"несколько человек, вещей, животных (они)\"\n" +
            "oni" + "≈ \"неопределенное лицо (лица)\"\n" +
            "si" + "≈ \"тот же самый человек, что и субъект\", если это не mi (я), ni (мы) или vi (ты, вы)\n" +
            "Личные местоимения могут иметь окончание винительного падежа -N\n" +
            "Если добавляется окончание -А к личному местоимению, то получается притяжательное местоимение:\n" +
            "mia" + "\"мой, моя, мое\"\n" + "nia" + "\"наш, наша, наше\"\n" +
            "via" + "\"твой, твоя, твое, ваш, ваша, ваше\"\n" + "lia" + "\"его\"\n" + "ŝia" +
            "\"её\"\n" + "ĝia" + "\"его, её (неодушевленные предметы)\"\n" +
            "ilia" + "\"их\"\n" + "onia" + "\"их\" (для неопределенных лиц)\n" + "sia" + "\"её, его\"";
    public final static String PREDL = "\nПредлоги\n" +
            "al – к, на, в, дательный падеж\n" +"anstataŭ – вместо\n" + "antaŭ – перед, прежде\n" +
            "apud – около, возле\n" + "da – притяжательный предлог, указывающий на количество\n" + "de – притяжательный предлог, указывающий на качество\n" +
            "dum – во время, в течение\n" + "ekde – с, начиная с, от\n" + "ekster – вне, снаружи\n" + "el – из\n" +
            "en – в\n" + "inter – между\n" + "je – на, с, предлог с неопределённым значением\n" +
            "kontraŭ – против, контр-\n" + "krom – кроме\n" + "kun – с, со\n" + "laŭ – по, согласно с\n" + "per – через, с помощью\n" + "por – для\n" + "post – после\n" +
            "pri – о, об\n" + "pro – из-за\n" + "sen – без\n" + "sub – под\n" + "super – над, сверх, пере-\n" + "sur – над\n" + "tra – через, сквозь\n" + "trans – через, за\n" + "ĉe – при, у\n" +
            "ĉirkaŭ – вокруг, около (о количестве, времени)\n" + "ĝis – до";
    public final static String CHISL = "\nnul" + " 0\n" + "unu" + " 1\n" + "du" + " 2\n" + "tri" + " 3\n" +
            "kvar" + " 4\n" + "kvin" + " 5\n" + "ses" + " 6\n" +
            "sep" + " 7\n" + "ok" + " 8\n" + "naŭ" + " 9\n" + "dek" + " 10\n" +
            "cent" + " 100\n" + "mil" + " 1000\n" + "Другие числа выражаются с помощью комбинации числительных. " +
            "Сначала говорят сколько тысяч, потом сотен, затем десятков и в конце сколько единиц.";
    public final static String PRISTV = "\nПриставки-предлоги:\n" +
            "В словообразовании эсперанто большое значение имеют так называемые приставки-предлоги (предлоги, способные присоединяться к другим словам).\n" +
            "\n" +
            "Al-  (\"к\"): iri – идти, aliri – подойти;\n" +
            "antaŭ- (\"перед\"): antaŭvidi – предвидеть, antaŭdiri – предсказать;\n" +
            "el-  (\"из\"):  iri – идти, eliri – выходить;\n"+
            "en- (\"в\"): eniri – входить, enmeti – вкладывать;\n" +
            "for-      (\"прочь\"): iri – идти, foriri – уйти, уходить;\n" +
            "inter-  (\"между\"): interparoli – беседовать, internacia – международный;\n" +
            "kontraŭ- (\"против\"): kontraŭstari – противостоять;\n" +
            "kun-  (\"с\"): labori – работать, kunlabori – сотрудничать;\n" +
            "pri-  (\"о\"): skribi – писать, priskribi – описывать;\n" +
            "sen-   (\"без\"): domo – дом, sendoma – бездомный;\n" +
            "sub-   (\"под\"): tero – земля, subtera – подземный;\n" +
            "tra-    (\"сквозь\"): vivi – жить, travivi – пережить;\n" +
            "trans- (\"через\"): salti – прыгать, transsalti – перепрыгнуть.";
    public final static String CYWW = "\nсуффиксы:\n" +
            "\n" +
            "-ist- (профессия): kuraci – лечить, kuracisto – врач;\n" +
            "-in- (женский род): studentino – студентка;\n" +
            "-il-  (инструмент): tranĉi – резать, tranĉilo – нож;\n" +
            "-ar- (совокупность): arbo – дерево, arbaro – лес;\n" +
            "-er- (частица): sablo – песок, sablero – песчинка;\n" +
            "-ej-  (помещение, место): manĝi – есть, manĝejo – столовая;\n" +
            "-ul-  (человек): juna – молодой, junulo – юноша;\n" +
            "-an- (член общества): partio – партия, partiano – член партии;\n" +
            "-aĵ - (вещь, объект действия): trinki – пить, trinkaĵo – напиток;\n" +
            "-ebl- (возможность): vidi – видеть, videbla – видимый;\n" +
            "-em- (склонность): dormi – спать, dormema – сонный;\n" +
            "-ind- (достойный чего-то): miri – удивляться, mirinda – удивительный;\n" +
            "-et-   (малый размер): dometo – домик, kubeto – кубик;\n" +
            "-eg-  (большой размер): domego – домище, pluvo – дождь, pluvego– ливень;\n" +
            "-ad-  (длительность действия): promeni – гулять, promenado – прогулка;\n" +
            "-ig-   (делать, заставлять): trinki – пить, trinkigi – поить, blanka –   белый, blankigi – белить;\n" +
            "-iĝ -  (делаться, становиться): pala – бледный, paliĝi – побледнеть;\n" +
            "-estr- (шеф, начальник): urbo – город, urbestro – мэр города;\n" +
            "-ec-    (абстрактное свойство, состояние): bela – красивый, beleco – красота;\n" +
            "-on-   (кратная часть): du – два, duono – половина;\n" +
            "-obl-  (кратность): kvar – четыре, kvaroble – четырехкратно, в четыре раза.";
    public final static String COW = "\nСоюзы\n" +
            "aŭ – или\n" +
            "kaj – и\n" +
            "ke – что, чтобы\n" +
            "kvankam – хотя\n" +
            "nek – ни\n" +
            "ol – чем\n" +
            "se – если\n" +
            "sed – но\n" +
            "ĉar – потому что, так как, ибо";
}
